DockablePaneInterop.PreTranslateMessage(tagMSG*)
Override message pre-translation to allow the WPF source to handle
any keyboard input properly, prior to Windows doing any sort of
translation or dispatching.
Remarks:
This pre-translation is required for proper handling of tabbing and other
keyboard mnemonics for the embedded WPF controls.

DockablePaneInterop.Dispose
Destruct the interop. No special processing as garbage collection should
take care of clearing of msg hook and destroying of hwnd source.

DockablePaneInterop.#ctor
Construct an interop handler.